
%作者:1204080522
%http://lvcha6255.blog.sohu.com/
figure(1);%定义函数
set(gcf,'color','black');%背景黑色
axis([0,50,0,45]);%绘制二维图形作者
hold on;%保持当前图形及轴系所有的特性
axis('off');%覆盖坐标刻度，并填充背景
fill([20,40,27,35,20,35],[10,33,30,45,27,30],'y');%画大闪电
line([45;48;45;47],[34;39;39;44],'color','y','linestyle','-','linewidth',3);%画小闪电 
plot([4;3],[35;30],'w') %画雨点
plot([46;45],[34;27],'w') 
plot([26;25],[44;40],'w') 
plot([26;25],[44;40],'w') 
plot([20;19],[39;34],'w')     
plot([10;9],[23;20],'w')     
plot([40;39],[24;20],'w') 
pause(1)
text1=text(1,35,'贝多芬的一生是伟大的，也是充满苦难的','color','c','fontsize',14)%                字幕
pause(2)
text1=text(1,30,'世界不曾给过他什么欢乐，而他却创造欢乐颂献给了世界','color','c','fontsize',14)%
pause(2)
text1=text(1,25,'他一生未婚，但对爱情的执着远胜他人','color','c','fontsize',14)%
pause(2)
text1=text(1,20,'他用音符，唱出对恋人的心曲','color','c','fontsize',14)%
pause(2)
text1=text(1,15,'犹如笛卡尔，给世界留下永恒','color','c','fontsize',14)%
pause(2)
text1=text(35,5,'----《致爱丽丝》','color','c','fontsize',14)%
hold on ;
pause(3)
clf;   %清屏幕
figure(1);%定义函数
set(gcf,'color','w');
axis([0,50,0,45]);%绘制二维图形
title('致爱丽丝','color','k','fontsize',20)
text(47,14*3,'曲: 贝多芬','color','k','fontsize',15)
hold on;%保持当前图形及轴系所有的特性
axis('off');%覆盖坐标刻度，并填充背景
                                                                                  %画五线谱谱
text(0,14*3,'简谱:','color','k','fontsize',15)%简谱符号
text(5.7,14*3,'1=C','color','k','fontsize',12)
text(8.9,14.28*3,'3','color','k','fontsize',12)
text(8.9,13.72*3,'4','color','k','fontsize',12)
fill([8.9,9.3,9.3,8.9],[14*3,14*3,14.01*3,14.01*3],'k');
fill([0,50,50,0],[12*3,12*3,12*3,12*3],'k');
fill([0,50,50,0],[11.5*3,11.5*3,11.5*3,11.5*3],'k');
fill([0,50,50,0],[11*3,11*3,11*3,11*3],'k');
fill([0,50,50,0],[10.5*3,10.5*3,10.5*3,10.5*3],'k');
fill([0,50,50,0],[10*3,10*3,10*3,10*3],'k');%第一部分
fill([0,50,50,0],[9*3,9*3,9*3,9*3],'k');
fill([0,50,50,0],[8.5*3,8.5*3,8.5*3,8.5*3],'k');
fill([0,50,50,0],[8*3,8*3,8*3,8*3],'k');
fill([0,50,50,0],[7.5*3,7.5*3,7.5*3,7.5*3],'k');
fill([0,50,50,0],[7*3,7*3,7*3,7*3],'k');%第二部分
fill([0,50,50,0],[6*3,6*3,6*3,6*3],'k');
fill([0,50,50,0],[5.5*3,5.5*3,5.5*3,5.5*3],'k');
fill([0,50,50,0],[5*3,5*3,5*3,5*3],'k');
fill([0,50,50,0],[4.5*3,4.5*3,4.5*3,4.5*3],'k');
fill([0,50,50,0],[4*3,4*3,4*3,4*3],'k');%第三部分
fill([0,50,50,0],[3*3,3*3,3*3,3*3],'k');
fill([0,50,50,0],[2.5*3,2.5*3,2.5*3,2.5*3],'k');
fill([0,50,50,0],[2*3,2*3,2*3,2*3],'k');
fill([0,50,50,0],[1.5*3,1.5*3,1.5*3,1.5*3],'k');
fill([0,50,50,0],[1*3,1*3,1*3,1*3],'k');%第四部分
pause(0.2);

text(2,9.3*3,'3','color','k','fontsize',14)%第一排简谱数字
text(6,9.3*3,'3','color','k','fontsize',14)%简谱符号
text(10,9.3*3,'2','color','k','fontsize',14)%简谱符号
text(14,9.3*3,'3','color','k','fontsize',14)%简谱符号
text(18,9.3*3,'2','color','k','fontsize',14)%简谱符号
text(22,9.3*3,'3','color','k','fontsize',14)%简谱符号
text(26,9.3*3,'7','color','k','fontsize',14)%简谱符号
text(30,9.3*3,'2','color','k','fontsize',14)%简谱符号
text(34,9.3*3,'1','color','k','fontsize',14)%简谱符号
text(38,9.3*3,'6','color','k','fontsize',14)%简谱符号
pause(1);
x1=0:0.01:2*pi;
a1=fill(1.8+0.7*cos(x1),10*3+0.5*sin(x1),'k');   %                                画音符
fill([2.3,2.3,2.3,2.3],[10*3,10*3,11.5*3,11.5*3],'k');
plot([2.3,3.2],[11.5*3,11.3*3],'k','LineWidth',2);
plot([3.2,3],[11.3*3,11.1*3],'k','LineWidth',2);%音阶3
pause(0.2);

a2=fill(7+0.7*cos(x1),11.65*3+0.5*sin(x1),'k');
fill([7.5,7.5,7.5,7.5],[10.4*3,10.4*3,11.65*3,11.65*3],'k');%音阶3高音
pause(0.2);

a3=fill(10+0.7*cos(x1),11.5*3+0.5*sin(x1),'k');
fill([10.6,10.6,10.6,10.6],[10.1*3,10.1*3,11.5*3,11.5*3],'k');%音阶2高音
plot([7.5,10.6],[10.4*3,10.1*3],'k','LineWidth',2);%连线
pause(0.2);


a4=fill(15+0.7*cos(x1),11.5*3+0.5*sin(x1),'k');
fill([15.5,15.5,15.5,15.5],[10.4*3,10.4*3,11.65*3,11.65*3],'k');%音阶3高音
pause(0.2);


a5=fill(18+0.7*cos(x1),11.5*3+0.5*sin(x1),'k');
fill([18.6,18.6,18.6,18.6],[10.1*3,10.1*3,11.5*3,11.5*3],'k');%音阶2高音
plot([15.5,18.6],[10.4*3,10.1*3],'k','LineWidth',2);%连线
pause(0.2);

a6=fill(23+0.7*cos(x1),11.65*3+0.5*sin(x1),'k');
fill([23.5,23.5,23.5,23.5],[10.4*3,10.4*3,11.65*3,11.65*3],'k');%音阶3高音
pause(0.2);

a7=fill(27+0.7*cos(x1),11*3+0.5*sin(x1),'k');%音阶7
fill([27.5,27.5,27.5,27.5],[11*3,11*3,12.5*3,12.5*3],'k');
plot([27.5,28.4],[12.5*3,12.3*3],'k','LineWidth',2);
plot([28.4,28.2],[12.3*3,12.1*3],'k','LineWidth',2);
pause(0.2);

a8=fill(32+0.7*cos(x1),11.5*3+0.5*sin(x1),'k');
fill([32.6,32.6,32.6,32.6],[10.3*3,10.3*3,11.5*3,11.5*3],'k');%音阶2高音
pause(0.2);

a9=fill(35+0.7*cos(x1),11.15*3+0.5*sin(x1),'k');
fill([35.6,35.6,35.6,35.6],[9.8*3,9.8*3,11.15*3,11.15*3],'k');%音阶1高音
plot([32.6,35.6],[10.3*3,9.8*3],'k','LineWidth',2);%连线
pause(0.2);
 a10=fill(41+0.7*cos(x1),10.65*3+0.5*sin(x1),'k');%音阶6
fill([41.5,41.5,41.5,41.5],[10.65*3,10.65*3,11.8*3,11.8*3],'k');
plot([41.5,42.4],[11.8*3,11.6*3],'k','LineWidth',2);
plot([42.4,42.2],[11.6*3,11.4*3],'k','LineWidth',2);%第一排完
pause(1);
text(4,6.3*3,'1','color','k','fontsize',14)%第2排简谱数字
text(8,6.3*3,'3','color','k','fontsize',14)%简谱符号
text(12,6.3*3,'6','color','k','fontsize',14)%简谱符号
text(16,6.3*3,'7','color','k','fontsize',14)%简谱符号
text(30,6.3*3,'7','color','k','fontsize',14)%简谱符号
text(35,6.3*3,'7','color','k','fontsize',14)%简谱符号
text(40,6.3*3,'6','color','k','fontsize',14)%简谱符号
pause(1);
 a11=fill(4+0.7*cos(x1),6.85*3+0.5*sin(x1),'k');%音阶1
fill([4.5,4.5,4.5,4.5],[6.85*3,6.85*3,7.9*3,7.9*3],'k');
pause(0.2);
 a12=fill(7+0.7*cos(x1),7*3+0.5*sin(x1),'k');%音阶3
fill([7.5,7.5,7.5,7.5],[7*3,7*3,8.4*3,8.4*3],'k');
pause(0.2);
 a13=fill(10+0.7*cos(x1),7.65*3+0.5*sin(x1),'k');%音阶6
fill([10.5,10.5,10.5,10.5],[7.65*3,7.65*3,8.85*3,8.85*3],'k');
plot([4.5,10.5],[7.9*3,8.85*3],'k','LineWidth',3);%连线
plot([4.5,10.5],[7.55*3,8.5*3],'k','LineWidth',3);%连线
pause(0.2);
 a14=fill(15+0.7*cos(x1),7*3+0.5*sin(x1),'k');   
fill([15.5,15.5,15.5,15.5],[7*3,7*3,8.2*3,8.2*3],'k');
plot([15.5,16.4],[8.2*3,8.0*3],'k','LineWidth',2);
plot([16.4,16.2],[8.0*3,7.8*3],'k','LineWidth',2);%音阶7
pause(0.2);
 a15=fill(30+0.7*cos(x1),8*3+0.5*sin(x1),'k');   
fill([30.5,30.5,30.5,30.5],[8*3,8*3,9*3,9*3],'k');%7
pause(0.2);
a1=fill(33+0.7*cos(x1),8*3+0.5*sin(x1),'k');   
fill([33.5,33.5,33.5,33.5],[8*3,8*3,9*3,9*3],'k');%7
pause(0.2);
 a16=fill(41+0.7*cos(x1),7.65*3+0.5*sin(x1),'k');%音阶6
fill([41.5,41.5,41.5,41.5],[7.65*3,7.65*3,8.85*3,8.85*3],'k');
plot([41.5,42.4],[8.85*3,8.65*3],'k','LineWidth',2);
plot([42.4,42.2],[8.65*3,8.45*3],'k','LineWidth',2);
plot([30.5,33.5],[9*3,9*3],'k','LineWidth',3);%连线第二排完
pause(1);
text(5,3.3*3,'7','color','k','fontsize',14)%第2排简谱数字
text(10,3.3*3,'1','color','k','fontsize',14)%简谱符号
text(15,3.3*3,'2','color','k','fontsize',14)%简谱符号
text(20,3.3*3,'3','color','k','fontsize',14)%简谱符号
text(25,3.3*3,'5','color','k','fontsize',14)%简谱符号
text(35,3.3*3,'4','color','k','fontsize',14)%简谱符号
text(40,3.3*3,'3','color','k','fontsize',14)%简谱符号
text(45,3.3*3,'2','color','k','fontsize',14)%简谱符号
pause(1);
 a17=fill(5+0.7*cos(x1),5*3+0.5*sin(x1),'k');%音阶7
fill([5.5,5.5,5.5,5.5],[5*3,5*3,6.2*3,6.2*3],'k');
plot([5.5,6.4],[6.2*3,6*3],'k','LineWidth',2);
plot([6.4,6.2],[6*3,5.8*3],'k','LineWidth',2);
pause(0.2);
 a18=fill(10+0.7*cos(x1),5.15*3+0.5*sin(x1),'k');%音阶1+
fill([10.5,10.5,10.5,10.5],[5.15*3,5.15*3,4*3,4*3],'k');
pause(0.2);
 a19=fill(13+0.7*cos(x1),5.5*3+0.5*sin(x1),'k');%音阶2+
fill([13.5,13.5,13.5,13.5],[5.5*3,5.5*3,4.2*3,4.2*3],'k');
pause(0.2);
 a20=fill(16+0.7*cos(x1),5.65*3+0.5*sin(x1),'k');%音阶3+
fill([16.65,16.65,16.65,16.65],[5.65*3,5.65*3,4.5*3,4.5*3],'k');
plot([10.5,16.65],[4*3,4.5*3],'k','LineWidth',3);%连线
pause(0.2);
 a21=fill(25+0.7*cos(x1),4.5*3+0.5*sin(x1),'k');%音阶5
fill([25.5,25.5,25.5,25.5],[4.5*3,4.5*3,5.7*3,5.7*3],'k');
plot([25.5,26.4],[5.7*3,5.5*3],'k','LineWidth',2);
plot([26.4,26.2],[5.5*3,5.4*3],'k','LineWidth',2);
pause(0.2);
 a22=fill(36+0.7*cos(x1),6*3+0.5*sin(x1),'k');%音阶4+
fill([36.5,36.5,36.5,36.5],[6*3,6*3,5*3,5*3],'k');
pause(0.2);
 a23=fill(41+0.7*cos(x1),5.65*3+0.5*sin(x1),'k');%音阶3+
fill([41.5,41.5,41.5,41.5],[5.65*3,5.65*3,4.75*3,4.75*3],'k');
pause(0.2);
 a24=fill(44+0.7*cos(x1),5.5*3+0.5*sin(x1),'k');%音阶2+
fill([44.5,44.5,44.5,44.5],[5.5*3,5.5*3,4.5*3,4.5*3],'k');
pause(0.2);
plot([36.5,44.5],[5*3,4.5*3],'k','LineWidth',3);%连线第三排完
pause(0.2);
text(5,0.3*3,'4','color','k','fontsize',14)%第2排简谱数字
text(10,0.3*3,'3','color','k','fontsize',14)%简谱符号
text(15,0.3*3,'2','color','k','fontsize',14)%简谱符号
text(20,0.3*3,'1','color','k','fontsize',14)%简谱符号
text(25,0.3*3,'3','color','k','fontsize',14)%简谱符号
text(30,0.3*3,'2','color','k','fontsize',14)%简谱符号
text(35,0.3*3,'1','color','k','fontsize',14)%简谱符号
text(40,0.3*3,'7','color','k','fontsize',14)%简谱符号
pause(1);
 a25=fill(5+0.7*cos(x1),1.15*3+0.5*sin(x1),'k');%音阶4
fill([5.5,5.5,5.5,5.5],[1.15*3,1.15*3,2.35*3,2.35*3],'k');
plot([5.5,6.4],[2.35*3,2.15*3],'k','LineWidth',2);
plot([6.4,6.2],[2.15*3,1.95*3],'k','LineWidth',2);
pause(0.2);                                                                
  a26=fill(10+0.7*cos(x1),2.65*3+0.5*sin(x1),'k');%音阶3+
fill([10.5,10.5,10.5,10.5],[2.65*3,2.65*3,1.5*3,1.5*3],'k');
pause(0.2);
 a27=fill(13+0.7*cos(x1),2.5*3+0.5*sin(x1),'k');%音阶2+
fill([13.5,13.5,13.5,13.5],[2.5*3,2.5*3,1.3*3,1.3*3],'k');
pause(0.2);
 a28=fill(16+0.7*cos(x1),2.15*3+0.5*sin(x1),'k');%音阶1+
fill([16.5,16.5,16.5,16.5],[2.15*3,2.15*3,0.95*3,0.95*3],'k');
pause(0.2);
plot([10.5,16.5],[1.5*3,0.95*3],'k','LineWidth',3);%连线
pause(0.2);
 a29=fill(25+0.7*cos(x1),1*3+0.5*sin(x1),'k');%音阶3
fill([25.5,25.5,25.5,25.5],[1*3,1*3,2.2*3,2.2*3],'k');
plot([25.5,26.4],[2.2*3,2*3],'k','LineWidth',2);
plot([26.4,26.2],[2*3,1.8*3],'k','LineWidth',2);
pause(0.2);
 a30=fill(30+0.7*cos(x1),2.5*3+0.5*sin(x1),'k');%音阶2+
fill([30.5,30.5,30.5,30.5],[2.5*3,2.5*3,1.3*3,1.3*3],'k');
pause(0.5);
 a31=fill(33+0.7*cos(x1),2.15*3+0.5*sin(x1),'k');%音阶1+
fill([33.5,33.5,33.5,33.5],[2.15*3,2.15*3,0.95*3,0.95*3],'k');
pause(0.5);
plot([30.5,33.5],[1.3*3,0.95*3],'k','LineWidth',3);%连线
pause(0.5);
 a32=fill(42+0.6*cos(x1),2*3+0.5*sin(x1),'k');%音阶7
fill([42.5,42.5,42.5,42.5],[2*3,2*3,3.2*3,3.2*3],'k');
plot([42.5,43.4],[3.2*3,3*3],'k','LineWidth',2);
plot([42.5,43.4],[3*3,2.8*3],'k','LineWidth',2);
plot([43.4,43.4],[3*3,2.6*3],'k','LineWidth',2);
pause(1)
head1=line(2.5,9.3*3,'color','c','linestyle','.','erasemode',... %                       设置光球运动
'xor', 'markersize',42);%设置小球颜色,大小,线条的擦拭方式
n=2.5;%设置初始位置
dn=4;
pause(0.5)
while n<=38
dn=4;
n=n+dn;
m=9.3*3;
set(head1,'xdata',n,'ydata',m);%设置小球的运动
drawnow;
pause(0.5);
end
delete(head1)
pause(0.5);
z=0:0.01:2*pi;                                  %画红心坐标
X=16*(sin(z)).^3+25;%x 坐标
Y=13*cos(z)-5*cos(2*z)-2*cos(3*z)-cos(4*z)+20;%y坐标
head2=line(4,6.3*3,'color','c','linestyle','.','erasemode',...
'xor', 'markersize',42);%设置小球颜色,大小,线条的擦拭方式
n=4;%设置初始位置
pause(0.5)
while n<=12
dn=4;
n=n+dn;
m=6.3*3;
set(head2,'xdata',n,'ydata',m);%设置小球的运动
drawnow;
pause(0.5);
end
delete(head2)
 txk=plot(X,Y,'r','LineWidth',1);%                                               画红心
head22=line(30,6.3*3,'color','c','linestyle','.','erasemode',...
'xor', 'markersize',42);%设置小球颜色,大小,线条的擦拭方式
n=30;%设置初始位置
pause(0.5)
while n<=35
dn=5;
n=n+dn;
m=6.3*3;
set(head22,'xdata',n,'ydata',m);%设置小球的运动
drawnow;
pause(0.2);
end
delete(head22)

head3=line(5,3.3*3,'color','c','linestyle','.','erasemode',...
'xor', 'markersize',42);%设置小球颜色,大小,线条的擦拭方式
n=5;%设置初始位置
pause(0.5)
while n<=20
dn=5;
n=n+dn;
m=3.3*3;
set(head3,'xdata',n,'ydata',m);%设置小球的运动
drawnow;
pause(0.2);
end
delete(head3)

head32=line(35,3.3*3,'color','c','linestyle','.','erasemode',...
'xor', 'markersize',42);%设置小球颜色,大小,线条的擦拭方式
n=35;%设置初始位置
pause(0.5)
while n<=40
dn=5;
n=n+dn;
m=3.3*3;
set(head32,'xdata',n,'ydata',m);%设置小球的运动
drawnow;
pause(0.2);
end
delete(head32)
head4=line(5,0.3*3,'color','c','linestyle','.','erasemode',...
'xor', 'markersize',42);%设置小球颜色,大小,线条的擦拭方式
n=5;%设置初始位置
pause(0.5)
while n<=40
dn=5;
n=n+dn;
m=0.3*3;
set(head4,'xdata',n,'ydata',m);%设置小球的运动
drawnow;
pause(0.4);
end
delete(head4)
txk=plot(X,Y,'r','LineWidth',2);%                                                 使红心闪动
tx1=fill(X,Y,'r','LineWidth',2);%画红心
pause(0.3)
delete(tx1)
pause(1)
tx1=fill(X,Y,'r','LineWidth',2);%画红心
pause(0.3)
delete(tx1)
pause(1)
tx1=fill(X,Y,'r','LineWidth',2);%画红心
pause(0.3)
delete(tx1)
delete(txk)
txk=plot(X,Y,'r','LineWidth',0.5);%画空心心红心
text1=text(0,45,'1204080522 聂成洋','color','c','fontsize',12)%




